# IFCTransformSetter Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCTransformSetter Properties
IFCTransformSetter Class See Also
---
The IFCTransformSetter type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace